<h1> Combine Data Tables

In [32]:
import pandas as pd

In [23]:
data_A = pd.DataFrame(
    {
        "NRP": [
            "1",
            "2",
            "3",
            "4",
        ],
        "Umur": [17, 18, 18,19],
        "JK": ["L", "L", "P","P"],
    }
)

In [25]:
data_B = pd.DataFrame(
    {
        "NRP": [
            "1",
            "1",
            "2",
            "3",
            "5",
        ],
        "MK": ["A", "B", "B","C","A"],
        "NILAI": ["A", "B+", "B","D","A"],
    }
)

In [10]:
data_A

  NRP  Umur JK
0   1    17  L
1   2    18  L
2   3    18  P

In [14]:
data_A_filtered = data_A[data_A["JK"]=="L"]
data_A_filtered

  NRP  Umur JK
0   1    17  L
1   2    18  L

In [15]:
data_A_filtered2 = data_A[data_A["JK"]=="P"]
data_A_filtered2

  NRP  Umur JK
2   3    18  P

In [17]:
data_A_new = pd.concat([data_A_filtered,data_A_filtered2], axis = 0)
data_A_new

  NRP  Umur JK
0   1    17  L
1   2    18  L
2   3    18  P

In [20]:
data_A_new.sort_values("Umur",ascending=False)

  NRP  Umur JK
1   2    18  L
2   3    18  P
0   1    17  L

In [11]:
data_B

  NRP MK NILAI
0   1  A     A
1   1  B    B+
2   2  B     B
3   3  C     D

In [26]:
data_baru = pd.merge(data_A, data_B, how='left', on='NRP')
data_baru

  NRP  Umur JK   MK NILAI
0   1    17  L    A     A
1   1    17  L    B    B+
2   2    18  L    B     B
3   3    18  P    C     D
4   4    19  P  NaN   NaN

In [27]:
data_baru = pd.merge(data_A, data_B, how='right', on='NRP')
data_baru

  NRP  Umur   JK MK NILAI
0   1  17.0    L  A     A
1   1  17.0    L  B    B+
2   2  18.0    L  B     B
3   3  18.0    P  C     D
4   5   NaN  NaN  A     A

In [30]:
data_C = pd.DataFrame(
    {
        "NM": [
            "1",
            "1",
            "2",
            "3",
            "5",
        ],
        "MK": ["A", "B", "B","C","A"],
        "NILAI": ["A", "B+", "B","D","A"],
    }
)

In [31]:
data_baru = pd.merge(data_A, data_C, how='inner', left_on='NRP',right_on="NM")
data_baru

  NRP  Umur JK NM MK NILAI
0   1    17  L  1  A     A
1   1    17  L  1  B    B+
2   2    18  L  2  B     B
3   3    18  P  3  C     D